; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	spectrograph2 - mode
	spectrograph0 - mode
	image1 - mode
	infrared3 - mode
	GroundStation4 - direction
	GroundStation3 - direction
	Star0 - direction
	Star5 - direction
	Star2 - direction
	Star1 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared3)
	(supports instrument2 image1)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument4 spectrograph2)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star5)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 infrared3)
	(supports instrument6 spectrograph2)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star0)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet7)
	(supports instrument8 infrared3)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 Star1)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
)
(:goal (and
	(pointing satellite2 Star14)
	(have_image Star6 infrared3)
	(have_image Planet7 spectrograph0)
	(have_image Planet8 spectrograph0)
	(have_image Planet9 spectrograph0)
	(have_image Phenomenon10 image1)
	(have_image Planet11 image1)
	(have_image Planet12 image1)
	(have_image Planet13 infrared3)
	(have_image Star14 spectrograph0)
))

)

; plan
1. (turn_to satellite0 star0 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star0)
   goals met: 0 of 10
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 10
3. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 10
4. (turn_to satellite0 planet13 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet13)
   goals met: 0 of 10
5. (take_image satellite0 planet13 instrument2 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 1 of 10
6. (turn_to satellite0 planet12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet12)
   goals met: 1 of 10
7. (take_image satellite0 planet12 instrument2 image1)
   added: (have_image planet12 image1)
   goals met: 2 of 10
8. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 2 of 10
9. (take_image satellite0 planet11 instrument2 image1)
   added: (have_image planet11 image1)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon10 instrument2 image1)
   added: (have_image phenomenon10 image1)
   goals met: 4 of 10
12. (turn_to satellite0 planet7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet7)
   goals met: 4 of 10
13. (take_image satellite0 planet7 instrument2 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 5 of 10
14. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 5 of 10
15. (take_image satellite0 planet8 instrument2 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 6 of 10
16. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 6 of 10
17. (take_image satellite0 planet9 instrument2 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 7 of 10
18. (turn_to satellite0 star14 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star14)
   goals met: 7 of 10
19. (take_image satellite0 star14 instrument2 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 8 of 10
20. (turn_to satellite0 star6 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star6)
   goals met: 8 of 10
21. (take_image satellite0 star6 instrument2 infrared3)
   added: (have_image star6 infrared3)
   goals met: 9 of 10
22. (turn_to satellite2 star14 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 star14)
   goals met: 10 of 10
